Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.CustomSnappingEventArgs
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.CustomSnappingEventArgs class provides the event arguments for custom snapping.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.CustomSnappingEventArgs.#ctor(Tekla.BIM.DirectManipulation.Services.Picking.PickPointResolveEventArgs)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.CustomSnappingEventArgs class.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.CustomSnappingEventArgs.CustomSnappedPoint
Gets the custom snapped point.